### Ask

- replace null values with something (eg. a median value)
- remove duplicate jobs

In [1]:
# Importing libraries
import pandas as pd
import matplotlib as plt

In [2]:
# Read the file
df = pd.read_csv("D:/Python/Luke Barousse course/Python-for-Data-Analysis/20_Pandas/data_jobs.csv")

In [4]:
# cleanup job posted date
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [5]:
df.loc[:10,'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0               NaN              NaN
1               NaN              NaN
2               NaN              NaN
3               NaN              NaN
4               NaN              NaN
5               NaN              NaN
6               NaN              NaN
7               NaN              NaN
8               NaN              NaN
9               NaN              NaN
10              NaN              NaN

In [13]:
# calculate median
median_salary_year = df['salary_year_avg'].median()

In [14]:
median_salary_hour = df['salary_hour_avg'].median()

In [16]:
# we want to keep our initial df intact, so we're going to create a new one and fill in the na values

df_filled = df

df_filled['salary_year_avg'] = df_filled['salary_year_avg'].fillna(median_salary_year)

In [18]:
#repeat for hourly column

df_filled['salary_hour_avg'] = df_filled['salary_hour_avg'].fillna(median_salary_hour)

In [20]:
df_filled.loc[:10,'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0          115000.0            45.98
1          115000.0            45.98
2          115000.0            45.98
3          115000.0            45.98
4          115000.0            45.98
5          115000.0            45.98
6          115000.0            45.98
7          115000.0            45.98
8          115000.0            45.98
9          115000.0            45.98
10         115000.0            45.98

### Dropping duplicates

In [23]:
df_unique = df_filled

df_unique = df_unique.drop_duplicates()


# let's find out how many lines we dropped
print('Length of original df: ', len(df_filled))
print('Length of dropped duplicates df:', len(df_unique))
print('Rows dropped:', len(df_filled)-len(df_unique))

Length of original df:  785741
Length of dropped duplicates df: 785640
Rows dropped: 101

In [24]:
# we can go further and specify columns that we want to filter by
# we want to look at company name and job title

df_unique = df_unique.drop_duplicates(subset=['job_title', 'company_name'])

print('Length of original df: ', len(df_filled))
print('Length of dropped duplicates df:', len(df_unique))
print('Rows dropped:', len(df_filled)-len(df_unique))

Length of original df:  785741
Length of dropped duplicates df: 508042
Rows dropped: 277699